import React from 'react';
import './teacherDetails.sass';

const TeacherDetails = ({ info }) => {
    console.log(info);
    const {
        first_name,
        last_name,
        photo,
        patronimic,
        email,
    } = info;
//     Освіта та кар’єра

//     1972 р.– закінчив Харківський Інститут радіоелектроніки(ХІРЕ) за спеціальністю “Електронні обчислювальні машини”.

//     1981 р.– кандидат технічних наук, дисертацію захистив у ХІРЕ.
    
//     1972 р.- асистент кафедри Математичних машин дискретної дії(ХІРЕ).
    
//     1982 р.- старший викладач ка - федри Обчис - лювальної те - хніки(ХІРЕ).
    
//     1984 р.- доцент кафедри Обчислювальної техніки(ХІРЕ).
    
//     1997 р.- Професор університету по кафедрі Автоматизації пректування обчислюваль - ної техніки(ХІРЕ).

//     Освітня діяльність

//     Викладає навчальні курси: бездротові комп’ютерні телекомунікаційні мережі; комп’ютерні технології в середовищі Internet of Things; Internet of Things(IoT); надійність та тестопридатність мікросистем; соціальний інженіринг в офісних системах.

//     Наукова діяльність

//     В рамках держбюджетної НДР брав участь у науково - дослідній роботі:

// «Кіберфізична система – «розумне хмарне управління транспортом».

// 2000 р.- запрошений професор у лабораторію LORIA - INRIA Nancy - 1(Франція) для участі у ауково - дослідній роботі: ”Тестування мережевих протоколів нової генерації  ІРv6”.

// Міжнародна діяльність
// 1986р.- відрядження до Алжирської народно - демократичної республіки в університет USTHB, доцент(проведення навчальної роботи за спеціальністю французькою мовою).
    
//     2000 р.- неодноразово запрошувався на викладацьку роботу в Університет Nancy - 1(Франція) та на науково - дослідну роботу в лабораторію LORIA - INRIA Nancy - 1(Франція) у якості запрошеного професора.

// Громадська діяльність
// 1995 р.– начальник відділу міжнародного співробітництва ХІРЕ – на громадських засадах.
    
//     1999 р.– декан підготовчого факультету іноземних громадян ХНУРЕ – на громадських засадах.
    
//     1997 р.- засновник, почесний президент “Спілки франкофонів Харкова” (UFK).
    
//     2000 р.- засновник і головний редактор “Франкофонної газети України” (Journal Francophone d’Ukraine).1995г.– начальник Отдела Международного сотрудничества ХИРЭ – на общественных началах.
    
//     1999 – декан подготовительного факультета иностранных граждан ХНУРЭ – на общественных началах.
    
//     1997 г. - основатель, почетный президент “Союза франкофонов Харькова” (UFK).
    
//     2000 г. - основатель и главный редактор “Франкофонной газеты Украины” (Journal Francophone d’Ukraine).

// Нагороди та премії
// 2003р.- Почесна грамота Міністерства освіти і науки України.
    
//     2005р.– Почесна грамота Харківської обл.держ.адміністрації, 2009р.– почесний знак “За заслуги” ректорату ХНУРЕ.

// Публікації та патенти

// Має понад 100 публікацій у тому числі 4 свідоцтва на винаходи, методичні вказівки, 3 сертифікованих дистанційних курсів.

    return(
        <div className="teacher--detailswrapper container">
            <h1 className="teacher-details__heading">{`${first_name} ${patronimic} ${last_name}`}</h1>
            <div className="teacher-details__sections-wrapper">
                <h2 className="h2">Основная информация</h2>
                <div className="teacher-details__sections">

                    <div className="teacher-details__section-right">
                        <p className="teacher-details__info-wrapper">Електронная почта:
                        <a className="teacher-details__info" href={`mailto:${email}`}>
                                {email}
                            </a>
                        </p>
                        <p className="teacher-details__info-wrapper">
                            Биография:
                        <div className="teacher-details__info">
                                Lorem ipsum doloaa sadasdasasdas
                        </div>
                        </p>
                    </div>
                    <div className="teacher-details__section-left">
                        <div className="teacher-details__photo">
                            <img src={photo} alt={`${first_name} ${last_name}`}></img>
                        </div>

                    </div>
                </div>
            </div>

        </div>
    );
}

export default TeacherDetails;